use Sya_MyBase_2
--1--
SELECT min(Цена) [минимальная],
max(Цена) [максимальная],
avg(Цена) [средняя],
count (*) [количество],
sum(Цена) [суммарная]
FROM Товары

--2--
SELECT Заказы.Наименование_товара ,  
max(Цена)  [Максимальная цена],  
count(*)  [Количество заказанных товаров]
From  Заказы  Inner Join  Товары 
On  Заказы.Наименование_товара = Товары.Наименование_товара  
And  Товары.Количество >5  
Group by Заказы.Наименование_товара

--3--
SELECT * FROM(SELECT CASE
WHEN Цена between 1 and 50 then '1-50'
WHEN Цена between 50 and 100 then '50-100'
else '>100'
END [диапазон],COUNT(*) as [количество]
FROM Товары GROUP BY CASE
WHEN Цена between 1 and 50 then '1-50'
WHEN Цена between 50 and 100 then '50-100'
else '>100'
END) AS T
ORDER BY Case [диапазон]
WHEN '1-50' then 3
WHEN '50-100' then 2
WHEN '>100' then 1
ELSE 0 END;

--4--
SELECT g.Наименование_товара, s.Покупатель ,f.Цена,
round(avg(cast(f.Цена AS float(2))), 2) 
FROM Товары f JOIN Заказы g ON  f.Наименование_товара = g.Наименование_товара  
inner join Заказчики s ON s.Покупатель = g.Заказчик
where f.Цена > 50
GROUP BY g.Наименование_товара,s.Покупатель , f.Цена

--5--
SELECT Наименование_товара, Цена, SUM(Количество)
FROM Товары
WHERE Наименование_товара IN('степлер','стол')
GROUP BY Наименование_товара, Цена

SELECT Наименование_товара, Цена, SUM(Количество)
FROM Товары
WHERE Наименование_товара IN('степлер','стол')
GROUP BY ROLLUP (Наименование_товара, Цена)

--6--
SELECT Наименование_товара, Цена, SUM(Количество)
FROM Товары
WHERE Наименование_товара IN('степлер','стол')
GROUP BY CUBE (Наименование_товара, Цена)

--7--
SELECT Наименование_товара, SUM(Количество)
FROM Товары
WHERE Наименование_товара ='степлер'
GROUP BY Наименование_товара
UNION 
SELECT Наименование_товара, SUM(Количество)
FROM Товары
WHERE Наименование_товара ='стол'
GROUP BY Наименование_товара

SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='степлер'
GROUP BY Наименование_товара
UNION All
SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='стол'
GROUP BY Наименование_товара

--8--
SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='степлер'
GROUP BY Наименование_товара
INTERSECT
SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='стол'
GROUP BY Наименование_товара

--9--
SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='степлер'
GROUP BY Наименование_товара
EXCEPT
SELECT Наименование_товара, SUM(Количество_ячеек)
FROM Заказы
WHERE Наименование_товара ='стол'
GROUP BY Наименование_товара

--10--
SELECT g.Наименование_товара, g.Цена,
(SELECT COUNT(*) FROM Товары g1 where g.Наименование_товара = g1.Наименование_товара 
and g.Цена=g1.Цена)[количество]
FROM Товары g
GROUP BY  g.Наименование_товара, g.Цена
HAVING g.Цена between 0 and 400
ORDER BY  g.Цена