use Sya_MyBase_2
---9,1----
select Заказы.Наименование_товара, Заказы.Дата_сделки,Товары.Цена
from Заказы, Товары
where Заказы.Наименование_товара=Товары.Наименование_товара
and Заказчик IN (
select Покупатель from Заказчики
where (Адрес like '%К%'))

---9,2----
select Заказы.Наименование_товара, Заказы.Дата_сделки,Товары.Цена
from Заказы inner join Товары
on Заказы.Наименование_товара=Товары.Наименование_товара
and Заказчик IN (
select Покупатель from Заказчики
where (Адрес like '%К%'))

---9,3----
select Заказы.Наименование_товара, Заказы.Дата_сделки,Товары.Цена
from Заказы inner join Товары
on Заказы.Наименование_товара=Товары.Наименование_товара
inner join Заказчики on Заказчики.Покупатель=Заказы.Заказчик
where (Адрес like '%К%')

---9,4----
select Наименование_товара, Номер_заказа from Заказы з
where Заказчик = (
select top(1) Заказчик from Заказы зк 
where зк.Наименование_товара=з.Наименование_товара
order by Номер_заказа desc)

---9,5----
select Наименование_товара from Товары
where not exists(
select * from Заказы
where Заказы.Наименование_товара=Товары.Наименование_товара)

---9,6----
select top(1)
(select avg(Цена) from Товары where Наименование_товара= N'Бумага')[Бумага],
(select avg(Цена) from Товары where Наименование_товара= N'Стол')[Стол],
(select avg(Цена) from Товары where Наименование_товара= N'Степлер')[Степлер]
from Товары

---9,7----
select Наименование_товара, Цена from Товары
where Цена >=all (
select Цена from Товары
where Наименование_товара like '%С%')

---9,8----
select Наименование_товара, Цена from Товары
where Цена >any (
select Цена from Товары
where Наименование_товара like '%С%')
